tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18857_tdd.h
#define SSP2STAT_nWRITE               522
#define SSP2STAT_I2C_READ             523
#define SSP2STAT_READ_WRITE           524
#define SSP2STAT_R_nW                 525
#define SSP2STAT_nW                   526
#define SSP2STAT_I2C_START            527
#define SSP2STAT_S                    528
#define SSP2STAT_I2C_STOP             529
#define SSP2STAT_P                    530
#define SSP2STAT_I2C_DAT              531
#define SSP2STAT_D_nA                 532
#define SSP2STAT_DATA_ADDRESS         533
#define SSP2STAT_nADDRESS             534
#define SSP2STAT_nA                   535
#define SSP2STAT_D_A                  536
#define SSP2STAT_CKE                  537
#define SSP2STAT_SMP                  538
#define SSP2CON1                      539
#define SSP2CON1_SSPM                 540
#define SSP2CON1_SSPM0                541
#define SSP2CON1_SSPM1                542
#define SSP2CON1_SSPM2                543
#define SSP2CON1_SSPM3                544
#define SSP2CON1_CKP                  545
#define SSP2CON1_SSPEN                546
#define SSP2CON1_SSPOV                547
#define SSP2CON1_WCOL                 548
#define SSP2CON2                      549
#define SSP2CON2_SEN                  550
#define SSP2CON2_ADMSK                551
#define SSP2CON2_RSEN                 552
#define SSP2CON2_ADMSK1               553
#define SSP2CON2_PEN                  554
#define SSP2CON2_ADMSK2               555
#define SSP2CON2_RCEN                 556
#define SSP2CON2_ADMSK3               557
#define SSP2CON2_ADMSK4               558
#define SSP2CON2_ACKEN                559
#define SSP2CON2_ADMSK5               560
#define SSP2CON2_ACKDT                561
#define SSP2CON2_ACKSTAT              562
#define SSP2CON2_GCEN                 563
#define SSP2CON3                      564
#define SSP2CON3_DHEN                 565
#define SSP2CON3_AHEN                 566
#define SSP2CON3_SBCDE                567
#define SSP2CON3_SDAHT                568
#define SSP2CON3_BOEN                 569
#define SSP2CON3_SCIE                 570
#define SSP2CON3_PCIE                 571
#define SSP2CON3_ACKTIM               572
#define TMR1L                         573
#define TMR1L0                        574
#define TMR1L1                        575
#define TMR1L2                        576
#define TMR1L3                        577
#define TMR1L4                        578
#define TMR1L5                        579
#define TMR1L6                        580
#define TMR1L7                        581
#define TMR1H0                        582
#define TMR1H                         583
#define TMR1H1                        584
#define TMR1H2                        585
#define TMR1H3                        586
#define TMR1H4                        587
#define TMR1H5                        588
#define TMR1H6                        589
#define TMR1H7                        590
#define T1CON                         591
#define TMR1ON                        592
#define T1CON_ON                      593
#define T1CON_RD16                    594
#define T1RD16                        595
#define nT1SYNC                       596
#define T1CON_nSYNC                   597
#define T1CON_CKPS0                   598
#define T1CKPS0                       599
#define T1CON_CKPS                    600
#define T1CKPS1                       601
#define T1CON_CKPS1                   602
#define T1GCON                        603
#define T1GCON_GVAL                   604
#define T1GVAL                        605
#define T1GGO_nDONE                   606
#define T1GCON_GGO_nDONE              607
#define T1GGO                         608
#define T1GSPM                        609
#define T1GCON_GSPM                   610
#define T1GTM                         611
#define T1GCON_GTM                    612
#define T1GPOL                        613
#define T1GCON_GPOL                   614
#define T1GE                          615
#define T1GCON_GE                     616
#define T1GATE                        617
#define T1GSS0                        618
#define T1GATE_GSS                    619
#define T1GATE_GSS0                   620
#define T1GATE_GSS1                   621
#define T1GSS1                        622
#define T1GSS2                        623
#define T1GATE_GSS2                   624
#define T1GSS3                        625
#define T1GATE_GSS3                   626
#define T1GATE_GSS4                   627
#define T1GSS4                        628
#define T1CLK                         629
#define T1CS0                         630
#define T1CLK_CS                      631
#define T1CLK_CS0                     632
#define T1CLK_CS1                     633
#define T1CS1                         634
#define T1CS2                         635
#define T1CLK_CS2                     636
#define T1CS3                         637
#define T1CLK_CS3                     638
#define TMR3L0                        639
#define TMR3L                         640
#define TMR3L1                        641
#define TMR3L2                        642
#define TMR3L3                        643
#define TMR3L4                        644
#define TMR3L5                        645
#define TMR3L6                        646
#define TMR3L7                        647
#define TMR3H                         648
#define TMR3H0                        649
#define TMR3H1                        650
#define TMR3H2                        651
#define TMR3H3                        652
#define TMR3H4                        653
#define TMR3H5                        654
#define TMR3H6                        655
#define TMR3H7                        656
#define T3CON                         657
#define TMR3ON                        658
#define T3CON_ON                      659
#define T3CON_RD16                    660
#define T3RD16                        661
#define nT3SYNC                       662
#define T3CON_nSYNC                   663
#define T3CKPS0                       664
#define T3CON_CKPS                    665
#define T3CON_CKPS0                   666
#define T3CKPS1                       667
#define T3CON_CKPS1                   668
#define T3GCON                        669
#define T3GVAL                        670
#define T3GCON_GVAL                   671
#define T3GGO                         672
#define T3GCON_GGO_nDONE              673
#define T3GGO_nDONE                   674
#define T3GCON_GSPM                   675
#define T3GSPM                        676
#define T3GTM                         677
#define T3GCON_GTM                    678
#define T3GPOL                        679
#define T3GCON_GPOL                   680
#define T3GCON_GE                     681
#define T3GE                          682
#define T3GATE                        683
#define T3GSS0                        684
#define T3GATE_GSS0                   685
#define T3GATE_GSS                    686
#define T3GATE_GSS1                   687
#define T3GSS1                        688
#define T3GSS2                        689
#define T3GATE_GSS2                   690
#define T3GATE_GSS3                   691
#define T3GSS3                        692
#define T3GATE_GSS4                   693
#define T3GSS4                        694
#define T3CLK                         695
#define T3CLK_CS                      696
#define T3CLK_CS0                     697
#define T3CS0                         698
#define T3CLK_CS1                     699
#define T3CS1                         700
#define T3CLK_CS2                     701
#define T3CS2                         702
#define T3CS3                         703
#define T3CLK_CS3                     704
#define TMR5L                         705
#define TMR5L0                        706
#define TMR5L1                        707
#define TMR5L2                        708
#define TMR5L3                        709
#define TMR5L4                        710
#define TMR5L5                        711
#define TMR5L6                        712
#define TMR5L7                        713
#define TMR5H0                        714
#define TMR5H                         715
#define TMR5H1                        716
#define TMR5H2                        717
#define TMR5H3                        718
#define TMR5H4                        719
#define TMR5H5                        720
#define TMR5H6                        721
#define TMR5H7                        722
#define T5CON                         723
#define T5CON_ON                      724
#define TMR5ON                        725
#define T5CON_RD16                    726
#define T5RD16                        727
#define T5CON_nSYNC                   728
#define nT5SYNC                       729
#define T5CON_CKPS0                   730
#define T5CON_CKPS                    731
#define T5CKPS0                       732
#define T5CON_CKPS1                   733
#define T5CKPS1                       734
#define T5GCON                        735
#define T5GCON_GVAL                   736
#define T5GVAL                        737
#define T5GCON_GGO_nDONE              738
#define T5GGO_nDONE                   739
#define T5GGO                         740
#define T5GCON_GSPM                   741
#define T5GSPM                        742
#define T5GTM                         743
#define T5GCON_GTM                    744
#define T5GPOL                        745
#define T5GCON_GPOL                   746
#define T5GCON_GE                     747
#define T5GE                          748
#define T5GATE                        749
#define T5GATE_GSS0                   750
#define T5GSS0                        751
#define T5GATE_GSS                    752
#define T5GSS1                        753
#define T5GATE_GSS1                   754
#define T5GATE_GSS2                   755
#define T5GSS2                        756
#define T5GATE_GSS3                   757
#define T5GSS3                        758
#define T5GSS4                        759
#define T5GATE_GSS4                   760
#define T5CLK                         761
#define T5CS0                         762
#define T5CLK_CS                      763
#define T5CLK_CS0                     764
#define T5CS1                         765
#define T5CLK_CS1                     766
#define T5CS2                         767
#define T5CLK_CS2                     768
#define T5CS3                         769
#define T5CLK_CS3                     770
#define CCPTMRS0                      771
#define C1TSEL0                       772
#define C1TSEL                        773
#define C1TSEL1                       774
#define C2TSEL0                       775
#define C2TSEL                        776
#define C2TSEL1                       777
#define C3TSEL0                       778
#define C3TSEL                        779
#define C3TSEL1                       780
#define C4TSEL                        781
#define C4TSEL0                       782
#define C4TSEL1                       783
#define CCPTMRS1                      784
#define C5TSEL                        785
#define C5TSEL0                       786
#define C5TSEL1                       787
#define P6TSEL0                       788
#define P6TSEL                        789
#define P6TSEL1                       790
#define P7TSEL0                       791
#define P7TSEL                        792
#define P7TSEL1                       793
#define T2TMR                         794
#define TMR2                          795
#define T2PR                          796
#define PR2                           797
#define T2CON                         798
#define T2OUTPS0                      799
#define T2CON_OUTPS0                  800
#define T2OUTPS                       801
#define T2CON_OUTPS                   802
#define T2OUTPS1                      803
#define T2CON_OUTPS1                  804
#define T2OUTPS2                      805
#define T2CON_OUTPS2                  806
#define T2OUTPS3                      807
#define T2CON_OUTPS3                  808
#define T2CKPS0                       809
#define T2CON_CKPS0                   810
#define T2CON_CKPS                    811
#define T2CKPS                        812
#define T2CKPS1                       813
#define T2CON_CKPS1                   814
#define T2CKPS2                       815
#define T2CON_CKPS2                   816
#define T2CON_ON                      817
#define TMR2ON                        818
#define T2ON                          819
#define T2HLT                         820
#define T2HLT_MODE                    821
#define T2MODE                        822
#define T2MODE0                       823
#define T2HLT_MODE0                   824
#define T2MODE1                       825
#define T2HLT_MODE1                   826
#define T2MODE2                       827
#define T2HLT_MODE2                   828
#define T2MODE3                       829
#define T2HLT_MODE3                   830
#define T2MODE4                       831
#define T2HLT_MODE4                   832
#define T2HLT_CKSYNC                  833
#define T2CKSYNC                      834
#define T2HLT_CKPOL                   835
#define T2CKPOL                       836
#define T2PSYNC                       837
#define T2HLT_PSYNC                   838
#define T2CLKCON                      839
#define T2CS                          840
#define T2CS0                         841
#define T2CS1                         842
#define T2CS2                         843
#define T2CS3                         844
#define T2RST                         845
#define T2RSEL                        846
#define T2RST_RSEL                    847
#define T2RSEL0                       848
#define T2RST_RSEL0                   849
#define T2RSEL1                       850
#define T2RST_RSEL1                   851
#define T2RST_RSEL2                   852
#define T2RSEL2                       853
#define T2RSEL3                       854
#define T2RST_RSEL3                   855
#define T2RSEL4                       856
#define T2RST_RSEL4                   857
#define T4TMR                         858
#define TMR4                          859
#define T4PR                          860
#define PR4                           861
#define T4CON                         862
#define T4CON_OUTPS                   863
#define T4OUTPS0                      864
#define T4OUTPS                       865
#define T4CON_OUTPS0                  866
#define T4OUTPS1                      867
#define T4CON_OUTPS1                  868
#define T4CON_OUTPS2                  869
#define T4OUTPS2                      870
#define T4OUTPS3                      871
#define T4CON_OUTPS3                  872
#define T4CKPS0                       873
#define T4CON_CKPS                    874
#define T4CON_CKPS0                   875
#define T4CKPS                        876
#define T4CKPS1                       877
#define T4CON_CKPS1                   878
#define T4CKPS2                       879
#define T4CON_CKPS2                   880
#define T4ON                          881
#define T4CON_ON                      882
#define TMR4ON                        883
#define T4HLT                         884
#define T4MODE                        885
#define T4HLT_MODE                    886
#define T4HLT_MODE0                   887
#define T4MODE0                       888
#define T4HLT_MODE1                   889
#define T4MODE1                       890
#define T4HLT_MODE2                   891
#define T4MODE2                       892
#define T4HLT_MODE3                   893
#define T4MODE3                       894
#define T4HLT_MODE4                   895
#define T4MODE4                       896
#define T4CKSYNC                      897
#define T4HLT_CKSYNC                  898
#define T4HLT_CKPOL                   899
#define T4CKPOL                       900
#define T4PSYNC                       901
#define T4HLT_PSYNC                   902
#define T4CLKCON                      903
#define T4CS0                         904
#define T4CS                          905
#define T4CS1                         906
#define T4CS2                         907
#define T4CS3                         908
#define T4RST                         909
#define T4RST_RSEL                    910
#define T4RSEL0                       911
#define T4RSEL                        912
#define T4RST_RSEL0                   913
#define T4RSEL1                       914
#define T4RST_RSEL1                   915
#define T4RSEL2                       916
#define T4RST_RSEL2                   917
#define T4RSEL3                       918
#define T4RST_RSEL3                   919
#define T4RSEL4                       920
#define T4RST_RSEL4                   921
#define T6TMR                         922
#define TMR6                          923
#define T6PR                          924
#define PR6                           925
#define T6CON                         926
#define T6CON_OUTPS0                  927
#define T6OUTPS                       928
#define T6CON_OUTPS                   929
#define T6OUTPS0                      930
#define T6CON_OUTPS1                  931
#define T6OUTPS1                      932
#define T6CON_OUTPS2                  933
#define T6OUTPS2                      934
#define T6CON_OUTPS3                  935
#define T6OUTPS3                      936
#define T6CON_CKPS0                   937
#define T6CKPS                        938
#define T6CKPS0                       939
#define T6CON_CKPS                    940
#define T6CON_CKPS1                   941
#define T6CKPS1                       942
#define T6CON_CKPS2                   943
#define T6CKPS2                       944
#define TMR6ON                        945
#define T6ON                          946
#define T6CON_ON                      947
#define T6HLT                         948
#define T6MODE0                       949
#define T6HLT_MODE0                   950
#define T6HLT_MODE                    951
#define T6MODE                        952
#define T6HLT_MODE1                   953
#define T6MODE1                       954
#define T6HLT_MODE2                   955
#define T6MODE2                       956
#define T6HLT_MODE3                   957
#define T6MODE3                       958
#define T6MODE4                       959
#define T6HLT_MODE4                   960
#define T6CKSYNC                      961
#define T6HLT_CKSYNC                  962
#define T6CKPOL                       963
#define T6HLT_CKPOL                   964
#define T6PSYNC                       965
#define T6HLT_PSYNC                   966
#define T6CLKCON                      967
#define T6CS                          968
#define T6CS0                         969
#define T6CS1                         970
#define T6CS2                         971
#define T6CS3                         972
#define T6RST                         973
#define T6RST_RSEL                    974
#define T6RSEL                        975
#define T6RSEL0                       976
#define T6RST_RSEL0                   977
#define T6RST_RSEL1                   978
#define T6RSEL1                       979
#define T6RSEL2                       980
#define T6RST_RSEL2                   981
#define T6RST_RSEL3                   982
#define T6RSEL3                       983
#define T6RST_RSEL4                   984
#define T6RSEL4                       985
#define CCPR1L                        986
#define CCPR1L_RL                     987
#define CCPR1H                        988
#define CCPR1H_RH                     989
#define CCP1CON                       990
#define CCP1MODE0                     991
#define CCP1CON_MODE0                 992
#define CCP1CON_MODE                  993
#define CCP1MODE                      994
#define CCP1MODE1                     995
#define CCP1CON_MODE1                 996
#define CCP1MODE2                     997
#define CCP1CON_MODE2                 998
#define CCP1MODE3                     999
#define CCP1CON_MODE3                 1000
#define CCP1FMT                       1001
#define CCP1CON_FMT                   1002
#define CCP1CON_OUT                   1003
#define CCP1OUT                       1004
#define CCP1CON_OE                    1005
#define CCP1OE                        1006
#define CCP1EN                        1007
#define CCP1CON_EN                    1008
#define CCP1CAP                       1009
#define CCP1CTS0                      1010
#define CCP1CAP_CTS                   1011
#define CCP1CAP_CTS0                  1012
#define CCP1CTS                       1013
#define CCP1CTS1                      1014
#define CCP1CAP_CTS1                  1015
#define CCP1CTS2                      1016
#define CCP1CAP_CTS2                  1017
#define CCPR2L                        1018
#define CCPR2L_RL                     1019
#define CCPR2H                        1020
#define CCPR2H_RH                     1021
#define CCP2CON                       1022
#define CCP2MODE                      1023
#define CCP2MODE0                     1024
#define CCP2CON_MODE0                 1025
#define CCP2CON_MODE                  1026
#define CCP2MODE1                     1027
#define CCP2CON_MODE1                 1028
#define CCP2MODE2                     1029
#define CCP2CON_MODE2                 1030
#define CCP2MODE3                     1031
#define CCP2CON_MODE3                 1032
#define CCP2FMT                       1033
#define CCP2CON_FMT                   1034
#define CCP2OUT                       1035
#define CCP2CON_OUT                   1036
#define CCP2OE                        1037
#define CCP2CON_OE                    1038
#define CCP2EN                        1039
#define CCP2CON_EN                    1040
#define CCP2CAP                       1041
#define CCP2CAP_CTS                   1042
#define CCP2CAP_CTS0                  1043
#define CCP2CTS                       1044
#define CCP2CTS0                      1045
#define CCP2CAP_CTS1                  1046
#define CCP2CTS1                      1047
#define CCP2CAP_CTS2                  1048
#define CCP2CTS2                      1049
#define CCPR3L                        1050
#define CCPR3L_RL                     1051
#define CCPR3H                        1052
#define CCPR3H_RH                     1053
#define CCP3CON                       1054
#define CCP3CON_MODE0                 1055
#define CCP3MODE0                     1056
#define CCP3CON_MODE                  1057
#define CCP3MODE                      1058
#define CCP3CON_MODE1                 1059
#define CCP3MODE1                     1060
#define CCP3CON_MODE2                 1061
#define CCP3MODE2                     1062
#define CCP3CON_MODE3                 1063
#define CCP3MODE3                     1064
#define CCP3CON_FMT                   1065
#define CCP3FMT                       1066
#define CCP3CON_OUT                   1067
#define CCP3OUT                       1068
#define CCP3OE                        1069
#define CCP3CON_OE                    1070
#define CCP3EN                        1071
#define CCP3CON_EN                    1072
#define CCP3CAP                       1073
#define CCP3CAP_CTS0                  1074
#define CCP3CTS                       1075
#define CCP3CAP_CTS                   1076
#define CCP3CTS0                      1077
#define CCP3CAP_CTS1                  1078
#define CCP3CTS1                      1079
#define CCP3CAP_CTS2                  1080
#define CCP3CTS2                      1081
#define CCPR4L                        1082
#define CCPR4L_RL                     1083
#define CCPR4H                        1084
#define CCPR4H_RH                     1085
#define CCP4CON                       1086
#define CCP4MODE                      1087
#define CCP4CON_MODE0                 1088
#define CCP4CON_MODE                  1089
#define CCP4MODE0                     1090
