tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18857_tdd.h
#define CM2PSEL_PCH2                  2765
#define C2PCH2                        2766
#define CLCDATA                       2767
#define MLC1OUT                       2768
#define MLC2OUT                       2769
#define MLC3OUT                       2770
#define MLC4OUT                       2771
#define CLC1CON                       2772
#define CLC1CON_MODE                  2773
#define LC1MODE0                      2774
#define LC1MODE                       2775
#define CLC1CON_MODE0                 2776
#define LC1MODE1                      2777
#define CLC1CON_MODE1                 2778
#define LC1MODE2                      2779
#define CLC1CON_MODE2                 2780
#define LC1INTN                       2781
#define CLC1CON_INTN                  2782
#define LC1INTP                       2783
#define CLC1CON_INTP                  2784
#define LC1OUT                        2785
#define CLC1CON_OUT                   2786
#define LC1EN                         2787
#define CLC1CON_EN                    2788
#define CLC1POL                       2789
#define LC1G1POL                      2790
#define CLC1POL_G1POL                 2791
#define CLC1POL_G2POL                 2792
#define LC1G2POL                      2793
#define LC1G3POL                      2794
#define CLC1POL_G3POL                 2795
#define LC1G4POL                      2796
#define CLC1POL_G4POL                 2797
#define CLC1POL_POL                   2798
#define LC1POL                        2799
#define CLC1SEL0                      2800
#define LC1D1S                        2801
#define CLC1SEL0_D1S0                 2802
#define LC1D1S0                       2803
#define CLC1SEL0_D1S                  2804
#define CLC1SEL0_D1S1                 2805
#define LC1D1S1                       2806
#define CLC1SEL0_D1S2                 2807
#define LC1D1S2                       2808
#define CLC1SEL0_D1S3                 2809
#define LC1D1S3                       2810
#define LC1D1S4                       2811
#define CLC1SEL0_D1S4                 2812
#define CLC1SEL0_D1S5                 2813
#define LC1D1S5                       2814
#define LC1D1S6                       2815
#define CLC1SEL0_D1S6                 2816
#define LC1D1S7                       2817
#define CLC1SEL0_D1S7                 2818
#define CLC1SEL1                      2819
#define CLC1SEL1_D2S                  2820
#define CLC1SEL1_D2S0                 2821
#define LC1D2S0                       2822
#define LC1D2S                        2823
#define CLC1SEL1_D2S1                 2824
#define LC1D2S1                       2825
#define CLC1SEL1_D2S2                 2826
#define LC1D2S2                       2827
#define CLC1SEL1_D2S3                 2828
#define LC1D2S3                       2829
#define LC1D2S4                       2830
#define CLC1SEL1_D2S4                 2831
#define D2S5                          2832
#define LC1D2S5                       2833
#define LC1D2S6                       2834
#define CLC1SEL1_D2S6                 2835
#define CLC1SEL1_D2S7                 2836
#define LC1D2S7                       2837
#define CLC1SEL2                      2838
#define CLC1SEL2_D3S                  2839
#define LC1D3S0                       2840
#define LC1D3S                        2841
#define CLC1SEL2_D3S0                 2842
#define LC1D3S1                       2843
#define CLC1SEL2_D3S1                 2844
#define LC1D3S2                       2845
#define CLC1SEL2_D3S2                 2846
#define LC1D3S3                       2847
#define CLC1SEL2_D3S3                 2848
#define LC1D3S4                       2849
#define CLC1SEL2_D3S4                 2850
#define LC1D3S5                       2851
#define CLC1SEL2_D3S5                 2852
#define LC1D3S6                       2853
#define CLC1SEL2_D3S6                 2854
#define LC1D3S7                       2855
#define CLC1SEL2_D3S7                 2856
#define CLC1SEL3                      2857
#define LC1D4S                        2858
#define CLC1SEL3_D4S                  2859
#define LC1D4S0                       2860
#define CLC1SEL3_D4S0                 2861
#define LC1D4S1                       2862
#define CLC1SEL3_D4S1                 2863
#define LC1D4S2                       2864
#define CLC1SEL3_D4S2                 2865
#define LC1D4S3                       2866
#define CLC1SEL3_D4S3                 2867
#define LC1D4S4                       2868
#define CLC1SEL3_D4S4                 2869
#define LC1D4S5                       2870
#define CLC1SEL3_D4S5                 2871
#define LC1D4S6                       2872
#define CLC1SEL3_D4S6                 2873
#define LC1D4S7                       2874
#define CLC1SEL3_D4S7                 2875
#define CLC1GLS0                      2876
#define CLC1GLS0_D1N                  2877
#define LC1G1D1N                      2878
#define CLC1GLS0_D1T                  2879
#define LC1G1D1T                      2880
#define LC1G1D2N                      2881
#define CLC1GLS0_D2N                  2882
#define LC1G1D2T                      2883
#define CLC1GLS0_D2T                  2884
#define CLC1GLS0_D3N                  2885
#define LC1G1D3N                      2886
#define CLC1GLS0_D3T                  2887
#define LC1G1D3T                      2888
#define CLC1GLS0_D4N                  2889
#define LC1G1D4N                      2890
#define CLC1GLS0_D4T                  2891
#define LC1G1D4T                      2892
#define CLC1GLS1                      2893
#define CLC1GLS1_D1N                  2894
#define LC1G2D1N                      2895
#define LC1G2D1T                      2896
#define CLC1GLS1_D1T                  2897
#define CLC1GLS1_D2N                  2898
#define LC1G2D2N                      2899
#define LC1G2D2T                      2900
#define CLC1GLS1_D2T                  2901
#define CLC1GLS1_D3N                  2902
#define LC1G2D3N                      2903
#define LC1G2D3T                      2904
#define CLC1GLS1_D3T                  2905
#define CLC1GLS1_D4N                  2906
#define LC1G2D4N                      2907
#define LC1G2D4T                      2908
#define CLC1GLS1_D4T                  2909
#define CLC1GLS2                      2910
#define CLC1GLS2_D1N                  2911
#define LC1G3D1N                      2912
#define LC1G3D1T                      2913
#define CLC1GLS2_D1T                  2914
#define LC1G3D2N                      2915
#define CLC1GLS2_D2N                  2916
#define LC1G3D2T                      2917
#define CLC1GLS2_D2T                  2918
#define CLC1GLS2_D3N                  2919
#define LC1G3D3N                      2920
#define LC1G3D3T                      2921
#define CLC1GLS2_D3T                  2922
#define LC1G3D4N                      2923
#define CLC1GLS2_D4N                  2924
#define LC1G3D4T                      2925
#define CLC1GLS2_D4T                  2926
#define CLC1GLS3                      2927
#define LC1G4D1N                      2928
#define CLC1GLS3_G4D1N                2929
#define LC1G4D1T                      2930
#define CLC1GLS3_G4D1T                2931
#define CLC1GLS3_G4D2N                2932
#define LC1G4D2N                      2933
#define CLC1GLS3_G4D2T                2934
#define LC1G4D2T                      2935
#define LC1G4D3N                      2936
#define CLC1GLS3_G4D3N                2937
#define LC1G4D3T                      2938
#define CLC1GLS3_G4D3T                2939
#define CLC1GLS3_G4D4N                2940
#define LC1G4D4N                      2941
#define CLC1GLS3_G4D4T                2942
#define LC1G4D4T                      2943
#define CLC2CON                       2944
#define LC2MODE0                      2945
#define CLC2CON_MODE                  2946
#define LC2MODE                       2947
#define CLC2CON_MODE0                 2948
#define LC2MODE1                      2949
#define CLC2CON_MODE1                 2950
#define LC2MODE2                      2951
#define CLC2CON_MODE2                 2952
#define LC2INTN                       2953
#define CLC2CON_INTN                  2954
#define LC2INTP                       2955
#define CLC2CON_INTP                  2956
#define CLC2CON_OUT                   2957
#define LC2OUT                        2958
#define CLC2CON_EN                    2959
#define LC2EN                         2960
#define CLC2POL                       2961
#define LC2G1POL                      2962
#define CLC2POL_G1POL                 2963
#define LC2G2POL                      2964
#define CLC2POL_G2POL                 2965
#define LC2G3POL                      2966
#define CLC2POL_G3POL                 2967
#define LC2G4POL                      2968
#define CLC2POL_G4POL                 2969
#define CLC2POL_POL                   2970
#define LC2POL                        2971
#define CLC2SEL0                      2972
#define CLC2SEL0_D1S                  2973
#define LC2D1S                        2974
#define LC2D1S0                       2975
#define CLC2SEL0_D1S0                 2976
#define LC2D1S1                       2977
#define CLC2SEL0_D1S1                 2978
#define LC2D1S2                       2979
#define CLC2SEL0_D1S2                 2980
#define LC2D1S3                       2981
#define CLC2SEL0_D1S3                 2982
#define LC2D1S4                       2983
#define CLC2SEL0_D1S4                 2984
#define LC2D1S5                       2985
#define CLC2SEL0_D1S5                 2986
#define LC2D1S6                       2987
#define CLC2SEL0_D1S6                 2988
#define LC2D1S7                       2989
#define CLC2SEL0_D1S7                 2990
#define CLC2SEL1                      2991
#define LC2D2S0                       2992
#define LC2D2S                        2993
#define CLC2SEL1_D2S                  2994
#define CLC2SEL1_D2S0                 2995
#define LC2D2S1                       2996
#define CLC2SEL1_D2S1                 2997
#define LC2D2S2                       2998
#define CLC2SEL1_D2S2                 2999
#define LC2D2S3                       3000
#define CLC2SEL1_D2S3                 3001
#define LC2D2S4                       3002
#define CLC2SEL1_D2S4                 3003
#define LC2D2S5                       3004
#define CLC2SEL1_D2S5                 3005
#define LC2D2S6                       3006
#define CLC2SEL1_D2S6                 3007
#define LC2D2S7                       3008
#define CLC2SEL1_D2S7                 3009
#define CLC2SEL2                      3010
#define CLC2SEL2_D3S0                 3011
#define LC2D3S                        3012
#define CLC2SEL2_D3S                  3013
#define LC2D3S0                       3014
#define CLC2SEL2_D3S1                 3015
#define LC2D3S1                       3016
#define CLC2SEL2_D3S2                 3017
#define LC2D3S2                       3018
#define CLC2SEL2_D3S3                 3019
#define LC2D3S3                       3020
#define CLC2SEL2_D3S4                 3021
#define LC2D3S4                       3022
#define CLC2SEL2_D3S5                 3023
#define LC2D3S5                       3024
#define CLC2SEL2_D3S6                 3025
#define LC2D3S6                       3026
#define CLC2SEL2_D3S7                 3027
#define LC2D3S7                       3028
#define CLC2SEL3                      3029
#define LC2D4S                        3030
#define CLC2SEL3_D4S0                 3031
#define LC2D4S0                       3032
#define CLC2SEL3_D4S                  3033
#define CLC2SEL3_D4S1                 3034
#define LC2D4S1                       3035
#define CLC2SEL3_D4S2                 3036
#define LC2D4S2                       3037
#define CLC2SEL3_D4S3                 3038
#define LC2D4S3                       3039
#define CLC2SEL3_D4S4                 3040
#define LC2D4S4                       3041
#define CLC2SEL3_D4S5                 3042
#define LC2D4S5                       3043
#define CLC2SEL3_D4S6                 3044
#define LC2D4S6                       3045
#define CLC2SEL3_D4S7                 3046
#define LC2D4S7                       3047
#define CLC2GLS0                      3048
#define LC2G1D1N                      3049
#define CLC2GLS0_D1N                  3050
#define CLC2GLS0_D1T                  3051
#define LC2G1D1T                      3052
#define LC2G1D2N                      3053
#define CLC2GLS0_D2N                  3054
#define CLC2GLS0_D2T                  3055
#define LC2G1D2T                      3056
#define LC2G1D3N                      3057
#define CLC2GLS0_D3N                  3058
#define CLC2GLS0_D3T                  3059
#define LC2G1D3T                      3060
#define LC2G1D4N                      3061
#define CLC2GLS0_D4N                  3062
#define CLC2GLS0_D4T                  3063
#define LC2G1D4T                      3064
#define CLC2GLS1                      3065
#define CLC2GLS1_D1N                  3066
#define LC2G2D1N                      3067
#define CLC2GLS1_D1T                  3068
#define LC2G2D1T                      3069
#define CLC2GLS1_D2N                  3070
#define LC2G2D2N                      3071
#define CLC2GLS1_D2T                  3072
#define LC2G2D2T                      3073
#define LC2G2D3N                      3074
#define CLC2GLS1_D3N                  3075
#define LC2G2D3T                      3076
#define CLC2GLS1_D3T                  3077
#define LC2G2D4N                      3078
#define CLC2GLS1_D4N                  3079
#define LC2G2D4T                      3080
#define CLC2GLS1_D4T                  3081
#define CLC2GLS2                      3082
#define LC2G3D1N                      3083
#define CLC2GLS2_D1N                  3084
#define CLC2GLS2_D1T                  3085
#define LC2G3D1T                      3086
#define CLC2GLS2_D2N                  3087
#define LC2G3D2N                      3088
#define LC2G3D2T                      3089
#define CLC2GLS2_D2T                  3090
#define CLC2GLS2_D3N                  3091
#define LC2G3D3N                      3092
#define CLC2GLS2_D3T                  3093
#define LC2G3D3T                      3094
#define CLC2GLS2_D4N                  3095
#define LC2G3D4N                      3096
#define LC2G3D4T                      3097
#define CLC2GLS2_D4T                  3098
#define CLC2GLS3                      3099
#define LC2G4D1N                      3100
#define CLC2GLS3_G4D1N                3101
#define CLC2GLS3_G4D1T                3102
#define LC2G4D1T                      3103
#define CLC2GLS3_G4D2N                3104
#define LC2G4D2N                      3105
#define LC2G4D2T                      3106
#define CLC2GLS3_G4D2T                3107
#define CLC2GLS3_G4D3N                3108
#define LC2G4D3N                      3109
#define CLC2GLS3_G4D3T                3110
#define LC2G4D3T                      3111
#define LC2G4D4N                      3112
#define CLC2GLS3_G4D4N                3113
#define CLC2GLS3_G4D4T                3114
#define LC2G4D4T                      3115
#define CLC3CON                       3116
#define LC3MODE                       3117
#define CLC3CON_MODE0                 3118
#define LC3MODE0                      3119
#define CLC3CON_MODE                  3120
#define CLC3CON_MODE1                 3121
#define LC3MODE1                      3122
#define CLC3CON_MODE2                 3123
#define LC3MODE2                      3124
#define LC3INTN                       3125
#define CLC3CON_INTN                  3126
#define LC3INTP                       3127
#define CLC3CON_INTP                  3128
#define LC3OUT                        3129
#define CLC3CON_OUT                   3130
#define LC3EN                         3131
#define CLC3CON_EN                    3132
#define CLC3POL                       3133
#define LC3G1POL                      3134
#define CLC3POL_G1POL                 3135
#define LC3G2POL                      3136
#define CLC3POL_G2POL                 3137
#define CLC3POL_G3POL                 3138
#define LC3G3POL                      3139
#define LC3G4POL                      3140
#define CLC3POL_G4POL                 3141
#define LC3POL                        3142
#define CLC3POL_POL                   3143
#define CLC3SEL0                      3144
#define LC3D1S                        3145
#define CLC3SEL0_D1S                  3146
#define LC3D1S0                       3147
#define CLC3SEL0_D1S0                 3148
#define LC3D1S1                       3149
#define CLC3SEL0_D1S1                 3150
#define LC3D1S2                       3151
#define CLC3SEL0_D1S2                 3152
#define LC3D1S3                       3153
#define CLC3SEL0_D1S3                 3154
#define LC3D1S4                       3155
#define CLC3SEL0_D1S4                 3156
#define LC3D1S5                       3157
#define CLC3SEL0_D1S5                 3158
#define LC3D1S6                       3159
#define CLC3SEL0_D1S6                 3160
#define LC3D1S7                       3161
#define CLC3SEL0_D1S7                 3162
#define CLC3SEL1                      3163
#define LC3D2S0                       3164
#define LC3D2S                        3165
#define CLC3SEL1_D2S0                 3166
#define CLC3SEL1_D2S                  3167
#define LC3D2S1                       3168
#define CLC3SEL1_D2S1                 3169
#define LC3D2S2                       3170
#define CLC3SEL1_D2S2                 3171
#define LC3D2S3                       3172
#define CLC3SEL1_D2S3                 3173
#define LC3D2S4                       3174
#define CLC3SEL1_D2S4                 3175
#define LC3D2S5                       3176
#define CLC3SEL1_D2S5                 3177
#define LC3D2S6                       3178
#define CLC3SEL1_D2S6                 3179
#define LC3D2S7                       3180
#define CLC3SEL1_D2S7                 3181
#define CLC3SEL2                      3182
#define LC3D3S                        3183
#define CLC3SEL2_D3S                  3184
#define LC3D3S0                       3185
#define CLC3SEL2_D3S0                 3186
#define LC3D3S1                       3187
#define CLC3SEL2_D3S1                 3188
#define LC3D3S2                       3189
#define CLC3SEL2_D3S2                 3190
#define LC3D3S3                       3191
#define CLC3SEL2_D3S3                 3192
#define LC3D3S4                       3193
#define CLC3SEL2_D3S4                 3194
#define LC3D3S5                       3195
#define CLC3SEL2_D3S5                 3196
#define LC3D3S6                       3197
#define CLC3SEL2_D3S6                 3198
#define LC3D3S7                       3199
#define CLC3SEL2_D3S7                 3200
#define CLC3SEL3                      3201
#define CLC3SEL3_D4S                  3202
#define LC3D4S0                       3203
#define LC3D4S                        3204
#define CLC3SEL3_D4S0                 3205
#define LC3D4S1                       3206
#define CLC3SEL3_D4S1                 3207
#define LC3D4S2                       3208
#define CLC3SEL3_D4S2                 3209
#define LC3D4S3                       3210
#define CLC3SEL3_D4S3                 3211
#define LC3D4S4                       3212
#define CLC3SEL3_D4S4                 3213
#define LC3D4S5                       3214
#define CLC3SEL3_D4S5                 3215
#define LC3D4S6                       3216
#define CLC3SEL3_D4S6                 3217
#define LC3D4S7                       3218
#define CLC3SEL3_D4S7                 3219
#define CLC3GLS0                      3220
#define CLC3GLS0_D1N                  3221
#define LC3G1D1N                      3222
#define LC3G1D1T                      3223
#define CLC3GLS0_D1T                  3224
#define LC3G1D2N                      3225
#define CLC3GLS0_D2N                  3226
#define CLC3GLS0_D2T                  3227
#define LC3G1D2T                      3228
#define CLC3GLS0_D3N                  3229
#define LC3G1D3N                      3230
#define LC3G1D3T                      3231
#define CLC3GLS0_D3T                  3232
#define CLC3GLS0_D4N                  3233
#define LC3G1D4N                      3234
#define CLC3GLS0_D4T                  3235
#define LC3G1D4T                      3236
#define CLC3GLS1                      3237
#define LC3G2D1N                      3238
#define CLC3GLS1_D1N                  3239
#define CLC3GLS1_D1T                  3240
#define LC3G2D1T                      3241
#define LC3G2D2N                      3242
#define CLC3GLS1_D2N                  3243
#define LC3G2D2T                      3244
#define CLC3GLS1_D2T                  3245
#define LC3G2D3N                      3246
#define CLC3GLS1_D3N                  3247
#define CLC3GLS1_D3T                  3248
#define LC3G2D3T                      3249
#define LC3G2D4N                      3250
#define CLC3GLS1_D4N                  3251
#define LC3G2D4T                      3252
#define CLC3GLS1_D4T                  3253
#define CLC3GLS2                      3254
#define LC3G3D1N                      3255
#define CLC3GLS2_D1N                  3256
#define LC3G3D1T                      3257
#define CLC3GLS2_D1T                  3258
#define CLC3GLS2_D2N                  3259
#define LC3G3D2N                      3260
#define CLC3GLS2_D2T                  3261
#define LC3G3D2T                      3262
#define CLC3GLS2_D3N                  3263
#define LC3G3D3N                      3264
#define LC3G3D3T                      3265
#define CLC3GLS2_D3T                  3266
#define CLC3GLS2_D4N                  3267
#define LC3G3D4N                      3268
#define CLC3GLS2_D4T                  3269
#define LC3G3D4T                      3270
#define CLC3GLS3                      3271
#define LC3G4D1N                      3272
#define CLC3GLS3_G4D1N                3273
#define LC3G4D1T                      3274
#define CLC3GLS3_G4D1T                3275
#define LC3G4D2N                      3276
#define CLC3GLS3_G4D2N                3277
#define CLC3GLS3_G4D2T                3278
#define LC3G4D2T                      3279
#define LC3G4D3N                      3280
#define CLC3GLS3_G4D3N                3281
#define CLC3GLS3_G4D3T                3282
#define LC3G4D3T                      3283
#define LC3G4D4N                      3284
#define CLC3GLS3_G4D4N                3285
#define LC3G4D4T                      3286
#define CLC3GLS3_G4D4T                3287
#define CLC4CON                       3288
#define LC4MODE                       3289
#define CLC4CON_MODE                  3290
#define LC4MODE0                      3291
#define CLC4CON_MODE0                 3292
#define LC4MODE1                      3293
#define CLC4CON_MODE1                 3294
#define LC4MODE2                      3295
#define CLC4CON_MODE2                 3296
#define LC4INTN                       3297
#define CLC4CON_INTN                  3298
#define CLC4CON_INTP                  3299
#define LC4INTP                       3300
#define CLC4CON_OUT                   3301
#define LC4OUT                        3302
#define CLC4CON_EN                    3303
#define LC4EN                         3304
#define CLC4POL                       3305
#define CLC4POL_G1POL                 3306
#define LC4G1POL                      3307
#define CLC4POL_G2POL                 3308
#define LC4G2POL                      3309
#define CLC4POL_G3POL                 3310
#define LC4G3POL                      3311
#define LC4G4POL                      3312
#define CLC4POL_G4POL                 3313
#define LC4POL                        3314
#define CLC4POL_POL                   3315
#define CLC4SEL0                      3316
#define LC4D1S0                       3317
#define CLC4SEL0_D1S                  3318
#define CLC4SEL0_D1S0                 3319
#define LC4D1S                        3320
#define LC4D1S1                       3321
#define CLC4SEL0_D1S1                 3322
