tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18857_tdd.h
#define LC4D1S2                       3323
#define CLC4SEL0_D1S2                 3324
#define LC4D1S3                       3325
#define CLC4SEL0_D1S3                 3326
#define LC4D1S4                       3327
#define CLC4SEL0_D1S4                 3328
#define LC4D1S5                       3329
#define CLC4SEL0_D1S5                 3330
#define LC4D1S6                       3331
#define CLC4SEL0_D1S6                 3332
#define LC4D1S7                       3333
#define CLC4SEL0_D1S7                 3334
#define CLC4SEL1                      3335
#define CLC4SEL1_D2S                  3336
#define CLC4SEL1_D2S0                 3337
#define LC4D2S                        3338
#define LC4D2S0                       3339
#define CLC4SEL1_D2S1                 3340
#define LC4D2S1                       3341
#define CLC4SEL1_D2S2                 3342
#define LC4D2S2                       3343
#define CLC4SEL1_D2S3                 3344
#define LC4D2S3                       3345
#define CLC4SEL1_D2S4                 3346
#define LC4D2S4                       3347
#define CLC4SEL1_D2S5                 3348
#define LC4D2S5                       3349
#define CLC4SEL1_D2S6                 3350
#define LC4D2S6                       3351
#define CLC4SEL1_D2S7                 3352
#define LC4D2S7                       3353
#define CLC4SEL2                      3354
#define CLC4SEL2_D3S                  3355
#define LC4D3S0                       3356
#define LC4D3S                        3357
#define CLC4SEL2_D3S0                 3358
#define LC4D3S1                       3359
#define CLC4SEL2_D3S1                 3360
#define LC4D3S2                       3361
#define CLC4SEL2_D3S2                 3362
#define LC4D3S3                       3363
#define CLC4SEL2_D3S3                 3364
#define LC4D3S4                       3365
#define CLC4SEL2_D3S4                 3366
#define LC4D3S5                       3367
#define CLC4SEL2_D3S5                 3368
#define LC4D3S6                       3369
#define CLC4SEL2_D3S6                 3370
#define LC4D3S7                       3371
#define CLC4SEL2_D3S7                 3372
#define CLC4SEL3                      3373
#define CLC4SEL3_D4S                  3374
#define LC4D4S0                       3375
#define CLC4SEL3_D4S0                 3376
#define LC4D4S                        3377
#define LC4D4S1                       3378
#define CLC4SEL3_D4S1                 3379
#define LC4D4S2                       3380
#define CLC4SEL3_D4S2                 3381
#define LC4D4S3                       3382
#define CLC4SEL3_D4S3                 3383
#define LC4D4S4                       3384
#define CLC4SEL3_D4S4                 3385
#define LC4D4S5                       3386
#define CLC4SEL3_D4S5                 3387
#define LC4D4S6                       3388
#define CLC4SEL3_D4S6                 3389
#define LC4D4S7                       3390
#define CLC4SEL3_D4S7                 3391
#define CLC4GLS0                      3392
#define CLC4GLS0_D1N                  3393
#define LC4G1D1N                      3394
#define CLC4GLS0_D1T                  3395
#define LC4G1D1T                      3396
#define CLC4GLS0_D2N                  3397
#define LC4G1D2N                      3398
#define CLC4GLS0_D2T                  3399
#define LC4G1D2T                      3400
#define CLC4GLS0_D3N                  3401
#define LC4G1D3N                      3402
#define CLC4GLS0_D3T                  3403
#define LC4G1D3T                      3404
#define CLC4GLS0_D4N                  3405
#define LC4G1D4N                      3406
#define CLC4GLS0_D4T                  3407
#define LC4G1D4T                      3408
#define CLC4GLS1                      3409
#define CLC4GLS1_D1N                  3410
#define LC4G2D1N                      3411
#define CLC4GLS1_D1T                  3412
#define LC4G2D1T                      3413
#define LC4G2D2N                      3414
#define CLC4GLS1_D2N                  3415
#define LC4G2D2T                      3416
#define CLC4GLS1_D2T                  3417
#define CLC4GLS1_D3N                  3418
#define LC4G2D3N                      3419
#define LC4G2D3T                      3420
#define CLC4GLS1_D3T                  3421
#define CLC4GLS1_D4N                  3422
#define LC4G2D4N                      3423
#define CLC4GLS1_D4T                  3424
#define LC4G2D4T                      3425
#define CLC4GLS2                      3426
#define CLC4GLS2_D1N                  3427
#define LC4G3D1N                      3428
#define CLC4GLS2_D1T                  3429
#define LC4G3D1T                      3430
#define LC4G3D2N                      3431
#define CLC4GLS2_D2N                  3432
#define LC4G3D2T                      3433
#define CLC4GLS2_D2T                  3434
#define CLC4GLS2_D3N                  3435
#define LC4G3D3N                      3436
#define CLC4GLS2_D3T                  3437
#define LC4G3D3T                      3438
#define LC4G3D4N                      3439
#define CLC4GLS2_D4N                  3440
#define LC4G3D4T                      3441
#define CLC4GLS2_D4T                  3442
#define CLC4GLS3                      3443
#define CLC4GLS3_G4D1N                3444
#define LC4G4D1N                      3445
#define LC4G4D1T                      3446
#define CLC4GLS3_G4D1T                3447
#define LC4G4D2N                      3448
#define CLC4GLS3_G4D2N                3449
#define LC4G4D2T                      3450
#define CLC4GLS3_G4D2T                3451
#define CLC4GLS3_G4D3N                3452
#define LC4G4D3N                      3453
#define CLC4GLS3_G4D3T                3454
#define LC4G4D3T                      3455
#define LC4G4D4N                      3456
#define CLC4GLS3_G4D4N                3457
#define LC4G4D4T                      3458
#define CLC4GLS3_G4D4T                3459
#define PPSLOCK                       3460
#define PPSLOCKED                     3461
#define INTPPS0                       3462
#define INTPPS                        3463
#define INTPPS1                       3464
#define INTPPS2                       3465
#define INTPPS3                       3466
#define T0CKIPPS                      3467
#define T0CKIPPS0                     3468
#define T0CKIPPS1                     3469
#define T0CKIPPS2                     3470
#define T0CKIPPS3                     3471
#define T1CKIPPS0                     3472
#define T1CKIPPS                      3473
#define T1CKIPPS1                     3474
#define T1CKIPPS2                     3475
#define T1CKIPPS3                     3476
#define T1CKIPPS4                     3477
#define T1GPPS0                       3478
#define T1GPPS                        3479
#define T1GPPS1                       3480
#define T1GPPS2                       3481
#define T1GPPS3                       3482
#define T1GPPS4                       3483
#define T3CKIPPS0                     3484
#define T3CKIPPS                      3485
#define T3CKIPPS1                     3486
#define T3CKIPPS2                     3487
#define T3CKIPPS3                     3488
#define T3CKIPPS4                     3489
#define T3GPPS0                       3490
#define T3GPPS                        3491
#define T3GPPS1                       3492
#define T3GPPS2                       3493
#define T3GPPS3                       3494
#define T3GPPS4                       3495
#define T5CKIPPS0                     3496
#define T5CKIPPS                      3497
#define T5CKIPPS1                     3498
#define T5CKIPPS2                     3499
#define T5CKIPPS3                     3500
#define T5CKIPPS4                     3501
#define T5GPPS                        3502
#define T5GPPS0                       3503
#define T5GPPS1                       3504
#define T5GPPS2                       3505
#define T5GPPS3                       3506
#define T5GPPS4                       3507
#define T2AINPPS                      3508
#define T2AINPPS0                     3509
#define T2AINPPS1                     3510
#define T2AINPPS2                     3511
#define T2AINPPS3                     3512
#define T2AINPPS4                     3513
#define T4AINPPS                      3514
#define T4AINPPS0                     3515
#define T4AINPPS1                     3516
#define T4AINPPS2                     3517
#define T4AINPPS3                     3518
#define T4AINPPS4                     3519
#define T6AINPPS0                     3520
#define T6AINPPS                      3521
#define T6AINPPS1                     3522
#define T6AINPPS2                     3523
#define T6AINPPS3                     3524
#define T6AINPPS4                     3525
#define CCP1PPS0                      3526
#define CCP1PPS                       3527
#define CCP1PPS1                      3528
#define CCP1PPS2                      3529
#define CCP1PPS3                      3530
#define CCP1PPS4                      3531
#define CCP2PPS0                      3532
#define CCP2PPS                       3533
#define CCP2PPS1                      3534
#define CCP2PPS2                      3535
#define CCP2PPS3                      3536
#define CCP2PPS4                      3537
#define CCP3PPS0                      3538
#define CCP3PPS                       3539
#define CCP3PPS1                      3540
#define CCP3PPS2                      3541
#define CCP3PPS3                      3542
#define CCP3PPS4                      3543
#define CCP4PPS0                      3544
#define CCP4PPS                       3545
#define CCP4PPS1                      3546
#define CCP4PPS2                      3547
#define CCP4PPS3                      3548
#define CCP4PPS4                      3549
#define CCP5PPS                       3550
#define CCP5PPS0                      3551
#define CCP5PPS1                      3552
#define CCP5PPS2                      3553
#define CCP5PPS3                      3554
#define CCP5PPS4                      3555
#define CCP6PPS                       3556
#define SMT1WINPPS                    3557
#define SMU1WINPPS0                   3558
#define SMU1WINPPS1                   3559
#define SMU1WINPPS2                   3560
#define SMU1WINPPS3                   3561
#define SMU1WINPPS4                   3562
#define SMT1SIGPPS                    3563
#define SMU1SIGPPS0                   3564
#define SMU1SIGPPS1                   3565
#define SMU1SIGPPS2                   3566
#define SMU1SIGPPS3                   3567
#define SMU1SIGPPS4                   3568
#define SMT2WINPPS                    3569
#define SMU2WINPPS0                   3570
#define SMU2WINPPS1                   3571
#define SMU2WINPPS2                   3572
#define SMU2WINPPS3                   3573
#define SMU2WINPPS4                   3574
#define SMT2SIGPPS                    3575
#define SMU2SIGPPS0                   3576
#define SMU2SIGPPS1                   3577
#define SMU2SIGPPS2                   3578
#define SMU2SIGPPS3                   3579
#define SMU2SIGPPS4                   3580
#define CWG1PPS0                      3581
#define CWG1PPS                       3582
#define CWG1PPS1                      3583
#define CWG1PPS2                      3584
#define CWG1PPS3                      3585
#define CWG1PPS4                      3586
#define CWG2PPS0                      3587
#define CWG2PPS                       3588
#define CWG2PPS1                      3589
#define CWG2PPS2                      3590
#define CWG2PPS3                      3591
#define CWG2PPS4                      3592
#define CWG3PPS0                      3593
#define CWG3PPS                       3594
#define CWG3PPS1                      3595
#define CWG3PPS2                      3596
#define CWG3PPS3                      3597
#define CWG3PPS4                      3598
#define MDCARLPPS                     3599
#define MDCARLPPS0                    3600
#define MDCARLPPS1                    3601
#define MDCARLPPS2                    3602
#define MDCARLPPS3                    3603
#define MDCARLPPS4                    3604
#define MDCARHPPS0                    3605
#define MDCARHPPS                     3606
#define MDCARHPPS1                    3607
#define MDCARHPPS2                    3608
#define MDCARHPPS3                    3609
#define MDCARHPPS4                    3610
#define MDSRCPPS0                     3611
#define MDSRCPPS                      3612
#define MDSRCPPS1                     3613
#define MDSRCPPS2                     3614
#define MDSRCPPS3                     3615
#define MDSRCPPS4                     3616
#define CLCIN0PPS                     3617
#define CLCIN0PPS0                    3618
#define CLCIN0PPS1                    3619
#define CLCIN0PPS2                    3620
#define CLCIN0PPS3                    3621
#define CLCIN0PPS4                    3622
#define CLCIN1PPS                     3623
#define CLCIN1PPS0                    3624
#define CLCIN1PPS1                    3625
#define CLCIN1PPS2                    3626
#define CLCIN1PPS3                    3627
#define CLCIN1PPS4                    3628
#define CLCIN2PPS                     3629
#define CLCIN2PPS0                    3630
#define CLCIN2PPS1                    3631
#define CLCIN2PPS2                    3632
#define CLCIN2PPS3                    3633
#define CLCIN2PPS4                    3634
#define CLCIN3PPS                     3635
#define CLCIN3PPS0                    3636
#define CLCIN3PPS1                    3637
#define CLCIN3PPS2                    3638
#define CLCIN3PPS3                    3639
#define CLCIN3PPS4                    3640
#define ADCACTPPS                     3641
#define ADCACTPPS0                    3642
#define ADCACTPPS1                    3643
#define ADCACTPPS2                    3644
#define ADCACTPPS3                    3645
#define ADCACTPPS4                    3646
#define SSP1CLKPPS                    3647
#define SSP1CLKPPS0                   3648
#define SSP1CLKPPS1                   3649
#define SSP1CLKPPS2                   3650
#define SSP1CLKPPS3                   3651
#define SSP1CLKPPS4                   3652
#define SSP1DATPPS                    3653
#define SSP1DATPPS0                   3654
#define SSP1DATPPS1                   3655
#define SSP1DATPPS2                   3656
#define SSP1DATPPS3                   3657
#define SSP1DATPPS4                   3658
#define SSP1SSPPS                     3659
#define SSP1SSPPS0                    3660
#define SSP1SSPPS1                    3661
#define SSP1SSPPS2                    3662
#define SSP1SSPPS3                    3663
#define SSP1SSPPS4                    3664
#define SSP2CLKPPS                    3665
#define SSP2CLKPPS0                   3666
#define SSP2CLKPPS1                   3667
#define SSP2CLKPPS2                   3668
#define SSP2CLKPPS3                   3669
#define SSP2CLKPPS4                   3670
#define SSP2DATPPS                    3671
#define SSP2DATPPS0                   3672
#define SSP2DATPPS1                   3673
#define SSP2DATPPS2                   3674
#define SSP2DATPPS3                   3675
#define SSP2DATPPS4                   3676
#define SSP2SSPPS                     3677
#define SSP2SSPPS0                    3678
#define SSP2SSPPS1                    3679
#define SSP2SSPPS2                    3680
#define SSP2SSPPS3                    3681
#define SSP2SSPPS4                    3682
#define RXPPS                         3683
#define RXPPS0                        3684
#define RXPPS1                        3685
#define RXPPS2                        3686
#define RXPPS3                        3687
#define RXPPS4                        3688
#define TXPPS                         3689
#define TXPPS0                        3690
#define TXPPS1                        3691
#define TXPPS2                        3692
#define TXPPS3                        3693
#define TXPPS4                        3694
#define RA0PPS                        3695
#define RA0PPS0                       3696
#define RA0PPS1                       3697
#define RA0PPS2                       3698
#define RA0PPS3                       3699
#define RA0PPS4                       3700
#define RA0PPS5                       3701
#define RA1PPS                        3702
#define RA1PPS0                       3703
#define RA1PPS1                       3704
#define RA1PPS2                       3705
#define RA1PPS3                       3706
#define RA1PPS4                       3707
#define RA1PPS5                       3708
#define RA2PPS                        3709
#define RA2PPS0                       3710
#define RA2PPS1                       3711
#define RA2PPS2                       3712
#define RA2PPS3                       3713
#define RA2PPS4                       3714
#define RA2PPS5                       3715
#define RA3PPS                        3716
#define RA3PPS0                       3717
#define RA3PPS1                       3718
#define RA3PPS2                       3719
#define RA3PPS3                       3720
#define RA3PPS4                       3721
#define RA3PPS5                       3722
#define RA4PPS                        3723
#define RA4PPS0                       3724
#define RA4PPS1                       3725
#define RA4PPS2                       3726
#define RA4PPS3                       3727
#define RA4PPS4                       3728
#define RA4PPS5                       3729
#define RA5PPS                        3730
#define RA5PPS0                       3731
#define RA5PPS1                       3732
#define RA5PPS2                       3733
#define RA5PPS3                       3734
#define RA5PPS4                       3735
#define RA5PPS5                       3736
#define RA6PPS                        3737
#define RA6PPS0                       3738
#define RA6PPS1                       3739
#define RA6PPS2                       3740
#define RA6PPS3                       3741
#define RA6PPS4                       3742
#define RA6PPS5                       3743
#define RA7PPS                        3744
#define RA7PPS0                       3745
#define RA7PPS1                       3746
#define RA7PPS2                       3747
#define RA7PPS3                       3748
#define RA7PPS4                       3749
#define RA7PPS5                       3750
#define RB0PPS                        3751
#define RB0PPS0                       3752
#define RB0PPS1                       3753
#define RB0PPS2                       3754
#define RB0PPS3                       3755
#define RB0PPS4                       3756
#define RB0PPS5                       3757
#define RB1PPS                        3758
#define RB1PPS0                       3759
#define RB1PPS1                       3760
#define RB1PPS2                       3761
#define RB1PPS3                       3762
#define RB1PPS4                       3763
#define RB1PPS5                       3764
#define RB2PPS                        3765
#define RB2PPS0                       3766
#define RB2PPS1                       3767
#define RB2PPS2                       3768
#define RB2PPS3                       3769
#define RB2PPS4                       3770
#define RB2PPS5                       3771
#define RB3PPS                        3772
#define RB3PPS0                       3773
#define RB3PPS1                       3774
#define RB3PPS2                       3775
#define RB3PPS3                       3776
#define RB3PPS4                       3777
#define RB3PPS5                       3778
#define RB4PPS                        3779
#define RB4PPS0                       3780
#define RB4PPS1                       3781
#define RB4PPS2                       3782
#define RB4PPS3                       3783
#define RB4PPS4                       3784
#define RB4PPS5                       3785
#define RB5PPS                        3786
#define RB5PPS0                       3787
#define RB5PPS1                       3788
#define RB5PPS2                       3789
#define RB5PPS3                       3790
#define RB5PPS4                       3791
#define RB5PPS5                       3792
#define RB6PPS                        3793
#define RB6PPS0                       3794
#define RB6PPS1                       3795
#define RB6PPS2                       3796
#define RB6PPS3                       3797
#define RB6PPS4                       3798
#define RB6PPS5                       3799
#define RB7PPS                        3800
#define RB7PPS0                       3801
#define RB7PPS1                       3802
#define RB7PPS2                       3803
#define RB7PPS3                       3804
#define RB7PPS4                       3805
#define RB7PPS5                       3806
#define RC0PPS                        3807
#define RC0PPS0                       3808
#define RC0PPS1                       3809
#define RC0PPS2                       3810
#define RC0PPS3                       3811
#define RC0PPS4                       3812
#define RC0PPS5                       3813
#define RC1PPS                        3814
#define RC1PPS0                       3815
#define RC1PPS1                       3816
#define RC1PPS2                       3817
#define RC1PPS3                       3818
#define RC1PPS4                       3819
#define RC1PPS5                       3820
#define RC2PPS                        3821
#define RC2PPS0                       3822
#define RC2PPS1                       3823
#define RC2PPS2                       3824
#define RC2PPS3                       3825
#define RC2PPS4                       3826
#define RC2PPS5                       3827
#define RC3PPS                        3828
#define RC3PPS0                       3829
#define RC3PPS1                       3830
#define RC3PPS2                       3831
#define RC3PPS3                       3832
#define RC3PPS4                       3833
#define RC3PPS5                       3834
#define RC4PPS                        3835
#define RC4PPS0                       3836
#define RC4PPS1                       3837
#define RC4PPS2                       3838
#define RC4PPS3                       3839
#define RC4PPS4                       3840
#define RC4PPS5                       3841
#define RC5PPS                        3842
#define RC5PPS0                       3843
#define RC5PPS1                       3844
#define RC5PPS2                       3845
#define RC5PPS3                       3846
#define RC5PPS4                       3847
#define RC5PPS5                       3848
#define RC6PPS                        3849
#define RC6PPS0                       3850
#define RC6PPS1                       3851
#define RC6PPS2                       3852
#define RC6PPS3                       3853
#define RC6PPS4                       3854
#define RC6PPS5                       3855
#define RC7PPS                        3856
#define RC7PPS0                       3857
#define RC7PPS1                       3858
#define RC7PPS2                       3859
#define RC7PPS3                       3860
#define RC7PPS4                       3861
#define RC7PPS5                       3862
#define ANSELA                        3863
#define ANSA0                         3864
#define ANSA1                         3865
#define ANSA2                         3866
#define ANSA3                         3867
#define ANSA4                         3868
#define ANSA5                         3869
#define ANSA6                         3870
#define ANSA7                         3871
#define WPUA                          3872
#define WPUA0                         3873
#define WPUA1                         3874
#define WPUA2                         3875
#define WPUA3                         3876
#define WPUA4                         3877
#define WPUA5                         3878
#define WPUA6                         3879
#define WPUA7                         3880
