tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18857_tdd.h
#define ODCONA                        3881
#define ODCA0                         3882
#define ODCA1                         3883
#define ODCA2                         3884
#define ODCA3                         3885
#define ODCA4                         3886
#define ODCA5                         3887
#define ODCA6                         3888
#define ODCA7                         3889
#define SLRCONA                       3890
#define SLRA0                         3891
#define SLRA1                         3892
#define SLRA2                         3893
#define SLRA3                         3894
#define SLRA4                         3895
#define SLRA5                         3896
#define SLRA6                         3897
#define SLRA7                         3898
#define INLVLA                        3899
#define INLVLA0                       3900
#define INLVLA1                       3901
#define INLVLA2                       3902
#define INLVLA3                       3903
#define INLVLA4                       3904
#define INLVLA5                       3905
#define INLVLA6                       3906
#define INLVLA7                       3907
#define IOCAP                         3908
#define IOCAP0                        3909
#define IOCAP1                        3910
#define IOCAP2                        3911
#define IOCAP3                        3912
#define IOCAP4                        3913
#define IOCAP5                        3914
#define IOCAP6                        3915
#define IOCAP7                        3916
#define IOCAN                         3917
#define IOCAN0                        3918
#define IOCAN1                        3919
#define IOCAN2                        3920
#define IOCAN3                        3921
#define IOCAN4                        3922
#define IOCAN5                        3923
#define IOCAN6                        3924
#define IOCAN7                        3925
#define IOCAF                         3926
#define IOCAF0                        3927
#define IOCAF1                        3928
#define IOCAF2                        3929
#define IOCAF3                        3930
#define IOCAF4                        3931
#define IOCAF5                        3932
#define IOCAF6                        3933
#define IOCAF7                        3934
#define CCDNA                         3935
#define CCDNA0                        3936
#define CCDNA1                        3937
#define CCDNA2                        3938
#define CCDNA3                        3939
#define CCDNA4                        3940
#define CCDNA5                        3941
#define CCDNA6                        3942
#define CCDNA7                        3943
#define CCDPA                         3944
#define CCDPA0                        3945
#define CCDPA1                        3946
#define CCDPA2                        3947
#define CCDPA3                        3948
#define CCDPA4                        3949
#define CCDPA5                        3950
#define CCDPA6                        3951
#define CCDPA7                        3952
#define ANSELB                        3953
#define ANSB0                         3954
#define ANSB1                         3955
#define ANSB2                         3956
#define ANSB3                         3957
#define ANSB4                         3958
#define ANSB5                         3959
#define ANSB6                         3960
#define ANSB7                         3961
#define WPUB                          3962
#define WPUB0                         3963
#define WPUB1                         3964
#define WPUB2                         3965
#define WPUB3                         3966
#define WPUB4                         3967
#define WPUB5                         3968
#define WPUB6                         3969
#define WPUB7                         3970
#define ODCONB                        3971
#define ODCB0                         3972
#define ODCB1                         3973
#define ODCB2                         3974
#define ODCB3                         3975
#define ODCB4                         3976
#define ODCB5                         3977
#define ODCB6                         3978
#define ODCB7                         3979
#define SLRCONB                       3980
#define SLRB0                         3981
#define SLRB1                         3982
#define SLRB2                         3983
#define SLRB3                         3984
#define SLRB4                         3985
#define SLRB5                         3986
#define SLRB6                         3987
#define SLRB7                         3988
#define INLVLB                        3989
#define INLVLB0                       3990
#define INLVLB1                       3991
#define INLVLB2                       3992
#define INLVLB3                       3993
#define INLVLB4                       3994
#define INLVLB5                       3995
#define INLVLB6                       3996
#define INLVLB7                       3997
#define IOCBP                         3998
#define IOCBP0                        3999
#define IOCBP1                        4000
#define IOCBP2                        4001
#define IOCBP3                        4002
#define IOCBP4                        4003
#define IOCBP5                        4004
#define IOCBP6                        4005
#define IOCBP7                        4006
#define IOCBN                         4007
#define IOCBN0                        4008
#define IOCBN1                        4009
#define IOCBN2                        4010
#define IOCBN3                        4011
#define IOCBN4                        4012
#define IOCBN5                        4013
#define IOCBN6                        4014
#define IOCBN7                        4015
#define IOCBF                         4016
#define IOCBF0                        4017
#define IOCBF1                        4018
#define IOCBF2                        4019
#define IOCBF3                        4020
#define IOCBF4                        4021
#define IOCBF5                        4022
#define IOCBF6                        4023
#define IOCBF7                        4024
#define CCDNB                         4025
#define CCDNB0                        4026
#define CCDNB1                        4027
#define CCDNB2                        4028
#define CCDNB3                        4029
#define CCDNB4                        4030
#define CCDNB5                        4031
#define CCDNB6                        4032
#define CCDNB7                        4033
#define CCDPB                         4034
#define CCDPB0                        4035
#define CCDPB1                        4036
#define CCDPB2                        4037
#define CCDPB3                        4038
#define CCDPB4                        4039
#define CCDPB5                        4040
#define CCDPB6                        4041
#define CCDPB7                        4042
#define ANSELC                        4043
#define ANSC0                         4044
#define ANSC1                         4045
#define ANSC2                         4046
#define ANSC3                         4047
#define ANSC4                         4048
#define ANSC5                         4049
#define ANSC6                         4050
#define ANSC7                         4051
#define WPUC                          4052
#define WPUC0                         4053
#define WPUC1                         4054
#define WPUC2                         4055
#define WPUC3                         4056
#define WPUC4                         4057
#define WPUC5                         4058
#define WPUC6                         4059
#define WPUC7                         4060
#define ODCONC                        4061
#define ODCC0                         4062
#define ODCC1                         4063
#define ODCC2                         4064
#define ODCC3                         4065
#define ODCC4                         4066
#define ODCC5                         4067
#define ODCC6                         4068
#define ODCC7                         4069
#define SLRCONC                       4070
#define SLRC0                         4071
#define SLRC1                         4072
#define SLRC2                         4073
#define SLRC3                         4074
#define SLRC4                         4075
#define SLRC5                         4076
#define SLRC6                         4077
#define SLRC7                         4078
#define INLVLC                        4079
#define INLVLC0                       4080
#define INLVLC1                       4081
#define INLVLC2                       4082
#define INLVLC3                       4083
#define INLVLC4                       4084
#define INLVLC5                       4085
#define INLVLC6                       4086
#define INLVLC7                       4087
#define IOCCP                         4088
#define IOCCP0                        4089
#define IOCCP1                        4090
#define IOCCP2                        4091
#define IOCCP3                        4092
#define IOCCP4                        4093
#define IOCCP5                        4094
#define IOCCP6                        4095
#define IOCCP7                        4096
#define IOCCN                         4097
#define IOCCN0                        4098
#define IOCCN1                        4099
#define IOCCN2                        4100
#define IOCCN3                        4101
#define IOCCN4                        4102
#define IOCCN5                        4103
#define IOCCN6                        4104
#define IOCCN7                        4105
#define IOCCF                         4106
#define IOCCF0                        4107
#define IOCCF1                        4108
#define IOCCF2                        4109
#define IOCCF3                        4110
#define IOCCF4                        4111
#define IOCCF5                        4112
#define IOCCF6                        4113
#define IOCCF7                        4114
#define CCDNC                         4115
#define CCDNC0                        4116
#define CCDNC1                        4117
#define CCDNC2                        4118
#define CCDNC3                        4119
#define CCDNC4                        4120
#define CCDNC5                        4121
#define CCDNC6                        4122
#define CCDNC7                        4123
#define CCDPC                         4124
#define CCDPC0                        4125
#define CCDPC1                        4126
#define CCDPC2                        4127
#define CCDPC3                        4128
#define CCDPC4                        4129
#define CCDPC5                        4130
#define CCDPC6                        4131
#define CCDPC7                        4132
#define WPUE                          4133
#define WPUE0                         4134
#define WPUE1                         4135
#define WPUE2                         4136
#define INLVLE                        4137
#define INLVLE0                       4138
#define INLVLE1                       4139
#define INLVLE2                       4140
#define IOCEP                         4141
#define IOCEP3                        4142
#define IOCEN                         4143
#define IOCEN3                        4144
#define IOCEF                         4145
#define IOCEF3                        4146
#define STATUS_SHAD                   4147
#define C_SHAD                        4148
#define DC_SHAD                       4149
#define Z_SHAD                        4150
#define WREG_SHAD                     4151
#define BSR_SHAD                      4152
#define PCLATH_SHAD                   4153
#define FSR0L_SHAD                    4154
#define FSR0H_SHAD                    4155
#define FSR1L_SHAD                    4156
#define FSR1H_SHAD                    4157
#define STKPTR                        4158
#define TOSL                          4159
#define TOSH                          4160

#endif // _PIC16LF18857_H_
